Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s.c
/****************************************************************************
 *
 * Copyright 2019 NXP Semiconductors All Rights Reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
 * either express or implied. See the License for the specific
 * language governing permissions and limitations under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <tinyara/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <semaphore.h>
#include <errno.h>
#include <assert.h>
#include <queue.h>
#include <debug.h>

#include <tinyara/irq.h>
#include <tinyara/arch.h>
#include <tinyara/kmalloc.h>
#include <tinyara/wdog.h>
#include <tinyara/wqueue.h>
#include <tinyara/audio/audio.h>
#include <tinyara/audio/i2s.h>

#include "irq/irq.h"

#include <arch/board/board.h>
#include "imxrt_i2s.h"
#include "imxrt_periphclks.h"
#include "imxrt_clock.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/
#define I2S_MAX_BUFFER_SIZE     (4096 - 8)	//the maximum RAM limited by lldesc
#define PLL_CLK                 (320000000)
#define I2S_BASE_CLK            (PLL_CLK / 2)
#define I2S_FULL_DUPLEX_SLAVE_MODE_MASK   (I2S_MODE_TX | I2S_MODE_RX | I2S_MODE_SLAVE)
#define I2S_FULL_DUPLEX_MASTER_MODE_MASK  (I2S_MODE_TX | I2S_MODE_RX | I2S_MODE_MASTER)

#define APLL_MIN_FREQ (250000000)
#define APLL_MAX_FREQ (500000000)
#define APLL_I2S_MIN_RATE (10675)	//in Hz, I2S Clock rate limited by hardware

#ifndef CONFIG_SCHED_WORKQUEUE
#error Work queue support is required (CONFIG_SCHED_WORKQUEUE)
#endif

#ifndef CONFIG_AUDIO
#error CONFIG_AUDIO required by this driver
#endif

#ifndef CONFIG_IMXRT_I2S_MAXINFLIGHT
#define CONFIG_IMXRT_I2S_MAXINFLIGHT 32
#endif

/* Assume no RX/TX support until we learn better */
#undef I2S_HAVE_RX
#undef I2S_HAVE_TX

#if defined(CONFIG_IMXRT_I2S)

/* Check for I2S RX support */
#if defined(CONFIG_IMXRT_I2S_RX)
#define I2S_HAVE_RX     1
#endif

/* Check for I2S TX support */
#if defined(CONFIG_IMXRT_I2S_TX)
#define I2S_HAVE_TX     1
#endif

#ifndef CONFIG_IMXRT_I2S_DATALEN
#define CONFIG_IMXRT_I2S_DATALEN        (I2S_BITS_PER_SAMPLE_16BIT)
#endif

#ifndef CONFIG_IMXRT_I2S_SAMPLERATE
#define CONFIG_IMXRT_I2S_SAMPLERATE     (44100)
#endif

#ifndef CONFIG_IMXRT_I2S_CHANNEL_FMT
#define CONFIG_IMXRT_I2S_CHANNEL_FMT    (I2S_CHANNEL_FMT_RIGHT_LEFT)
#endif

#ifndef CONFIG_IMXRT_I2S_COMM_FMT
#define CONFIG_IMXRT_I2S_COMM_FMT       I2S_COMM_FORMAT_I2S
#endif

#ifndef CONFIG_IMXRT_I2S_INTR_LEVEL
#define CONFIG_IMXRT_I2S_INTR_LEVEL    (1)
#endif

#endif

#ifdef CONFIG_DEBUG
#define CONFIG_DEBUG_FEATURES
#endif

#define DEBUG_I2S_DRIVER    0

#undef i2serr
#undef i2sinfo
#if defined(DEBUG_I2S_DRIVER) && (0 < DEBUG_I2S_DRIVER)
#define i2sinfo(format, ...)   printf(format, ##__VA_ARGS__)
#define i2serr(format, ...)   printf(format, ##__VA_ARGS__)
#else
#define i2sinfo(format, ...)
#endif
#define i2serr(format, ...)   printf(format, ##__VA_ARGS__)

#if defined(I2S_HAVE_RX) || defined(I2S_HAVE_TX)

#ifndef MIN
#define MIN(a,b) a < b ? a : b
#endif

#define OVER_SAMPLE_RATE (384U)

/****************************************************************************
 * Private Types
 ****************************************************************************/

enum _sai_transfer_state {
	kSAI_Busy = 0x0U, /*!< SAI is busy */
	kSAI_Idle,        /*!< Transfer is done. */
	kSAI_Error        /*!< Transfer error occured. */
};

/* I2S configuration parameters for i2s_param_config function */
typedef struct {
	i2s_mode_t mode;			/*!< I2S work mode */
	int sample_rate;			/*!< I2S sample rate */
	i2s_bits_per_sample_t bits_per_sample;	/*!< I2S bits per sample */
	i2s_channel_fmt_t channel_format;	/*!< I2S channel format */
	i2s_comm_format_t communication_format;	/*!< I2S communication format */

	int int_alloc_level;		/*INT level */

	bool use_apll;				/*!< I2S using APLL as main I2S clock, enable it to get accurate clock */
	int fixed_mclk;				/*!< I2S using fixed MCLK output. If use_apll = true and fixed_mclk > 0, then the clock output for i2s is fixed and equal to the fixed_mclk value. */
} i2s_config_t;

/* The state of the one I2S peripheral */

struct imxrt_i2s_s {
	struct i2s_dev_s dev;           /* Externally visible I2S interface, must the first element!! */

	i2s_port_t i2s_num;             /* I2S controller register base address */
	I2S_Type * i2s_base;

	int intrupt_level;
	int tx_isr_num;                 /* isr tx number */
	int rx_isr_num;                 /* isr rx number */
	xcpt_t isr_handler;             /* irs handler */

	i2s_err_cb_t err_cb;            /* registered error callback function */
	void *err_cb_arg;               /* argiment to return with err cb call */

	sem_t exclsem;                  /* Assures mutually exclusive acess to I2S */

	uint8_t rxenab:1;               /* True: RX transfers enabled */
	uint8_t txenab:1;               /* True: TX transfers enabled */

	i2s_mode_t mode;                /*!< I2S work mode */
	int sample_rate;                /*!< I2S sample rate */
	int channel_num;                /*!< Number of channels */
	int bytes_per_sample;           /*!< Bytes per sample */
	int bits_per_sample;            /*!< Bits per sample */

	bool use_apll;                  /*!< I2S use APLL clock */
	int fixed_mclk;                 /*!< I2S fixed MLCK clock */

