Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s.c
#if defined(FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER) && (FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER)
/*!
 * @brief Set the master clock divider.
 *
 * This API will compute the master clock divider according to master clock frequency and master
 * clock source clock source frequency.
 *
 * @param base SAI base pointer.
 * @param mclk_Hz Mater clock frequency in Hz.
 * @param mclkSrcClock_Hz Master clock source frequency in Hz.
 */
static void i2s_setmasterclockdivider(I2S_Type *base, uint32_t mclk_Hz, uint32_t mclkSrcClock_Hz)
{
	uint32_t freq = mclkSrcClock_Hz;
	uint16_t fract, divide;
	uint32_t remaind = 0;
	uint32_t current_remainder = 0xFFFFFFFFU;
	uint16_t current_fract = 0;
	uint16_t current_divide = 0;
	uint32_t mul_freq = 0;
	uint32_t max_fract = 256;

	/*In order to prevent overflow */
	freq /= 100;
	mclk_Hz /= 100;

	/* Compute the max fract number */
	max_fract = mclk_Hz * 4096 / freq + 1;
	if (max_fract > 256) {
		max_fract = 256;
	}

	/* Looking for the closet frequency */
	for (fract = 1; fract < max_fract; fract++) {
		mul_freq = freq * fract;
		remaind = mul_freq % mclk_Hz;
		divide = mul_freq / mclk_Hz;

		/* Find the exactly frequency */
		if (remaind == 0) {
			current_fract = fract;
			current_divide = mul_freq / mclk_Hz;
			break;
		}

		/* Closer to next one, set the closest to next data */
		if (remaind > mclk_Hz / 2) {
			remaind = mclk_Hz - remaind;
			divide += 1;
		}

		/* Update the closest div and fract */
		if (remaind < current_remainder) {
			current_fract = fract;
			current_divide = divide;
			current_remainder = remaind;
		}
	}

	/* Fill the computed fract and divider to registers */
	base->MDR = I2S_MDR_DIVIDE(current_divide - 1) | I2S_MDR_FRACT(current_fract - 1);

	/* Waiting for the divider updated */
	while (base->MCR & I2S_MCR_DUF_MASK) {
	}
}
#endif /* FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER */

/*!
 * @brief Get the instance number for SAI.
 *
 * @param base SAI base pointer.
 */
uint32_t i2s_getinstance(I2S_Type *base)
{
	uint32_t instance;

	/* Find the instance index from base address mappings. */
	for (instance = 0; instance < ARRAY_SIZE(s_saiBases); instance++) {
		if (s_saiBases[instance] == base) {
			break;
		}
	}

	DEBUGASSERT(instance < ARRAY_SIZE(s_saiBases));

	return instance;
}

/*!
 * @brief sends a piece of data in non-blocking way.
 *
 * @param base SAI base pointer
 * @param channel Data channel used.
 * @param bitWidth How many bits in a audio word, usually 8/16/24/32 bits.
 * @param buffer Pointer to the data to be written.
 * @param size Bytes to be written.
 */
static void i2s_write_nonblocking(I2S_Type *base, uint32_t channel, uint32_t bitWidth, uint8_t *buffer, uint32_t size)
{
	uint32_t i = 0;
	uint8_t j = 0;
	uint8_t bytesPerWord = bitWidth / 8U;
	uint32_t data = 0;
	uint32_t temp = 0;

	for (i = 0; i < size / bytesPerWord; i++) {
		for (j = 0; j < bytesPerWord; j++) {
			temp = (uint32_t)(*buffer);
			data |= (temp << (8U * j));
			buffer++;
		}
		base->TDR[channel] = data;
		data = 0;
	}
}

/*!
 * @brief Receive a piece of data in non-blocking way.
 *
 * @param base SAI base pointer
 * @param channel Data channel used.
 * @param bitWidth How many bits in a audio word, usually 8/16/24/32 bits.
 * @param buffer Pointer to the data to be read.
 * @param size Bytes to be read.
 */
static void i2s_read_nonblocking(I2S_Type *base, uint32_t channel, uint32_t bitWidth, uint8_t *buffer, uint32_t size)
{
	uint32_t i = 0;
	uint8_t j = 0;
	uint8_t bytesPerWord = bitWidth / 8U;
	uint32_t data = 0;

	for (i = 0; i < size / bytesPerWord; i++) {
		data = base->RDR[channel];
		for (j = 0; j < bytesPerWord; j++) {
			*buffer = (data >> (8U * j)) & 0xFF;
			buffer++;
		}
	}
}

/*!
 * @brief Enables/disables the SAI Tx.
 *
 * @param base SAI base pointer
 * @param enable True means enable SAI Tx, false means disable.
 */
void i2s_tx_enable(I2S_Type *base, bool enable)
{
	if (enable) {
		/* If clock is sync with Rx, should enable RE bit. */
		if (((base->TCR2 & I2S_TCR2_SYNC_MASK) >> I2S_TCR2_SYNC_SHIFT) == 0x1U) {
			base->RCSR = ((base->RCSR & 0xFFE3FFFFU) | I2S_RCSR_RE_MASK);
		}
		base->TCSR = ((base->TCSR & 0xFFE3FFFFU) | I2S_TCSR_TE_MASK);
		/* Also need to clear the FIFO error flag before start */
		i2s_tx_clearstatusflag(base, kSAI_FIFOErrorFlag);
	} else {
		/* If RE not sync with TE, than disable TE, otherwise, shall not disable TE */
		if (((base->RCR2 & I2S_RCR2_SYNC_MASK) >> I2S_RCR2_SYNC_SHIFT) != 0x1U) {
			/* Should not close RE even sync with Rx */
			base->TCSR = ((base->TCSR & 0xFFE3FFFFU) & (~I2S_TCSR_TE_MASK));
		}
	}
}

/*!
 * @brief Enables/disables the SAI Rx.
 *
 * @param base SAI base pointer
 * @param enable True means enable SAI Rx, false means disable.
 */
void i2s_rx_enable(I2S_Type *base, bool enable)
{
	if (enable) {
		/* If clock is sync with Tx, should enable TE bit. */
		if (((base->RCR2 & I2S_RCR2_SYNC_MASK) >> I2S_RCR2_SYNC_SHIFT) == 0x1U) {
			base->TCSR = ((base->TCSR & 0xFFE3FFFFU) | I2S_TCSR_TE_MASK);
		}
		base->RCSR = ((base->RCSR & 0xFFE3FFFFU) | I2S_RCSR_RE_MASK);
		/* Also need to clear the FIFO error flag before start */
		i2s_rx_clearstatusflags(base, kSAI_FIFOErrorFlag);
	} else {
		/* While TX is not sync with RX, close RX */
		if (((base->TCR2 & I2S_TCR2_SYNC_MASK) >> I2S_TCR2_SYNC_SHIFT) != 0x1U) {
			base->RCSR = ((base->RCSR & 0xFFE3FFFFU) & (~I2S_RCSR_RE_MASK));
		}
	}
}

/*!
 * @name Initialization and deinitialization
 * @{
 */

/*!
 * @brief Initializes the SAI Tx peripheral.
 *
 * Ungates the SAI clock, resets the module, and configures SAI Tx with a configuration structure.
 * The configuration structure can be custom filled or set with default values by
 * SAI_TxGetDefaultConfig().
 *
 * @note  This API should be called at the beginning of the application to use
 * the SAI driver. Otherwise, accessing the SAIM module can cause a hard fault
 * because the clock is not enabled.
 *
 * @param base SAI base pointer
 * @param config SAI configuration structure.
*/
void i2s_tx_init(I2S_Type *base, const sai_config_t *config)
{
	uint32_t val = 0;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
	/* Enable the SAI clock */
	imxrt_clock_enableclock(s_saiClock[i2s_getinstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if defined(FSL_FEATURE_SAI_HAS_MCR) && (FSL_FEATURE_SAI_HAS_MCR)
	/* Master clock source setting */
	val = (base->MCR & ~I2S_MCR_MICS_MASK);
	base->MCR = (val | I2S_MCR_MICS(config->mclkSource));

	/* Configure Master clock output enable */
	val = (base->MCR & ~I2S_MCR_MOE_MASK);
	base->MCR = (val | I2S_MCR_MOE(config->mclkOutputEnable));
#endif /* FSL_FEATURE_SAI_HAS_MCR */

	/* Configure audio protocol */
	switch (config->protocol) {
	case kSAI_BusLeftJustified:
		base->TCR2 |= I2S_TCR2_BCP_MASK;
		base->TCR3 &= ~I2S_TCR3_WDFL_MASK;
		base->TCR4 = I2S_TCR4_MF(1U) | I2S_TCR4_SYWD(31U) | I2S_TCR4_FSE(0U) | I2S_TCR4_FSP(0U) | I2S_TCR4_FRSZ(1U);
		break;
	case kSAI_BusRightJustified:
		base->TCR2 |= I2S_TCR2_BCP_MASK;
		base->TCR3 &= ~I2S_TCR3_WDFL_MASK;
		base->TCR4 = I2S_TCR4_MF(1U) | I2S_TCR4_SYWD(31U) | I2S_TCR4_FSE(0U) | I2S_TCR4_FSP(0U) | I2S_TCR4_FRSZ(1U);
		break;
	case kSAI_BusI2S:
		base->TCR2 |= I2S_TCR2_BCP_MASK;
		base->TCR3 &= ~I2S_TCR3_WDFL_MASK;
		base->TCR4 = I2S_TCR4_MF(1U) | I2S_TCR4_SYWD(31U) | I2S_TCR4_FSE(1U) | I2S_TCR4_FSP(1U) | I2S_TCR4_FRSZ(1U);
		break;
	case kSAI_BusPCMA:
		base->TCR2 &= ~I2S_TCR2_BCP_MASK;
		base->TCR3 &= ~I2S_TCR3_WDFL_MASK;
		base->TCR4 = I2S_TCR4_MF(1U) | I2S_TCR4_SYWD(0U) | I2S_TCR4_FSE(1U) | I2S_TCR4_FSP(0U) | I2S_TCR4_FRSZ(1U);
		break;
	case kSAI_BusPCMB:
		base->TCR2 &= ~I2S_TCR2_BCP_MASK;
		base->TCR3 &= ~I2S_TCR3_WDFL_MASK;
		base->TCR4 = I2S_TCR4_MF(1U) | I2S_TCR4_SYWD(0U) | I2S_TCR4_FSE(0U) | I2S_TCR4_FSP(0U) | I2S_TCR4_FRSZ(1U);
		break;
	default:
		break;
	}

	/* Set master or slave */
	if (config->masterSlave == kSAI_Master) {
		base->TCR2 |= I2S_TCR2_BCD_MASK;
		base->TCR4 |= I2S_TCR4_FSD_MASK;

		/* Bit clock source setting */
		val = base->TCR2 & (~I2S_TCR2_MSEL_MASK);
		base->TCR2 = (val | I2S_TCR2_MSEL(config->bclkSource));
	} else {
		base->TCR2 &= ~I2S_TCR2_BCD_MASK;
		base->TCR4 &= ~I2S_TCR4_FSD_MASK;
	}

