Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s.c
	/* Set Sync mode */
	switch (config->syncMode) {
	case kSAI_ModeAsync:
		val = base->TCR2;
		val &= ~I2S_TCR2_SYNC_MASK;
		base->TCR2 = (val | I2S_TCR2_SYNC(0U));
		break;
	case kSAI_ModeSync:
		val = base->TCR2;
		val &= ~I2S_TCR2_SYNC_MASK;
		base->TCR2 = (val | I2S_TCR2_SYNC(1U));
		/* If sync with Rx, should set Rx to async mode */
		val = base->RCR2;
		val &= ~I2S_RCR2_SYNC_MASK;
		base->RCR2 = (val | I2S_RCR2_SYNC(0U));
		break;
	case kSAI_ModeSyncWithOtherTx:
		val = base->TCR2;
		val &= ~I2S_TCR2_SYNC_MASK;
		base->TCR2 = (val | I2S_TCR2_SYNC(2U));
		break;
	case kSAI_ModeSyncWithOtherRx:
		val = base->TCR2;
		val &= ~I2S_TCR2_SYNC_MASK;
		base->TCR2 = (val | I2S_TCR2_SYNC(3U));
		break;
	default:
		break;
	}
}

/*!
 * @brief Initializes the SAI Rx peripheral.
 *
 * Ungates the SAI clock, resets the module, and configures the SAI Rx with a configuration structure.
 * The configuration structure can be custom filled or set with default values by
 * SAI_RxGetDefaultConfig().
 *
 * @note  This API should be called at the beginning of the application to use
 * the SAI driver. Otherwise, accessing the SAI module can cause a hard fault
 * because the clock is not enabled.
 *
 * @param base SAI base pointer
 * @param config SAI configuration structure.
 */
void i2s_rx_init(I2S_Type *base, const sai_config_t *config)
{
	uint32_t val = 0;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
	/* Enable SAI clock first. */
	imxrt_clock_enableclock(s_saiClock[i2s_getinstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if defined(FSL_FEATURE_SAI_HAS_MCR) && (FSL_FEATURE_SAI_HAS_MCR)
	/* Master clock source setting */
	val = (base->MCR & ~I2S_MCR_MICS_MASK);
	base->MCR = (val | I2S_MCR_MICS(config->mclkSource));

	/* Configure Master clock output enable */
	val = (base->MCR & ~I2S_MCR_MOE_MASK);
	base->MCR = (val | I2S_MCR_MOE(config->mclkOutputEnable));
#endif /* FSL_FEATURE_SAI_HAS_MCR */

	/* Configure audio protocol */
	switch (config->protocol) {
	case kSAI_BusLeftJustified:
		base->RCR2 |= I2S_RCR2_BCP_MASK;
		base->RCR3 &= ~I2S_RCR3_WDFL_MASK;
		base->RCR4 = I2S_RCR4_MF(1U) | I2S_RCR4_SYWD(31U) | I2S_RCR4_FSE(0U) | I2S_RCR4_FSP(0U) | I2S_RCR4_FRSZ(1U);
		break;
	case kSAI_BusRightJustified:
		base->RCR2 |= I2S_RCR2_BCP_MASK;
		base->RCR3 &= ~I2S_RCR3_WDFL_MASK;
		base->RCR4 = I2S_RCR4_MF(1U) | I2S_RCR4_SYWD(31U) | I2S_RCR4_FSE(0U) | I2S_RCR4_FSP(0U) | I2S_RCR4_FRSZ(1U);
		break;
	case kSAI_BusI2S:
		base->RCR2 |= I2S_RCR2_BCP_MASK;
		base->RCR3 &= ~I2S_RCR3_WDFL_MASK;
		base->RCR4 = I2S_RCR4_MF(1U) | I2S_RCR4_SYWD(31U) | I2S_RCR4_FSE(1U) | I2S_RCR4_FSP(1U) | I2S_RCR4_FRSZ(1U);
		break;
	case kSAI_BusPCMA:
		base->RCR2 &= ~I2S_RCR2_BCP_MASK;
		base->RCR3 &= ~I2S_RCR3_WDFL_MASK;
		base->RCR4 = I2S_RCR4_MF(1U) | I2S_RCR4_SYWD(0U) | I2S_RCR4_FSE(1U) | I2S_RCR4_FSP(0U) | I2S_RCR4_FRSZ(1U);
		break;
	case kSAI_BusPCMB:
		base->RCR2 &= ~I2S_RCR2_BCP_MASK;
		base->RCR3 &= ~I2S_RCR3_WDFL_MASK;
		base->RCR4 = I2S_RCR4_MF(1U) | I2S_RCR4_SYWD(0U) | I2S_RCR4_FSE(0U) | I2S_RCR4_FSP(0U) | I2S_RCR4_FRSZ(1U);
		break;
	default:
		break;
	}

	/* Set master or slave */
	if (config->masterSlave == kSAI_Master) {
		base->RCR2 |= I2S_RCR2_BCD_MASK;
		base->RCR4 |= I2S_RCR4_FSD_MASK;

		/* Bit clock source setting */
		val = base->RCR2 & (~I2S_RCR2_MSEL_MASK);
		base->RCR2 = (val | I2S_RCR2_MSEL(config->bclkSource));
	} else {
		base->RCR2 &= ~I2S_RCR2_BCD_MASK;
		base->RCR4 &= ~I2S_RCR4_FSD_MASK;
	}

	/* Set Sync mode */
	switch (config->syncMode) {
	case kSAI_ModeAsync:
		val = base->RCR2;
		val &= ~I2S_RCR2_SYNC_MASK;
		base->RCR2 = (val | I2S_RCR2_SYNC(0U));
		break;
	case kSAI_ModeSync:
		val = base->RCR2;
		val &= ~I2S_RCR2_SYNC_MASK;
		base->RCR2 = (val | I2S_RCR2_SYNC(1U));
		/* If sync with Tx, should set Tx to async mode */
		val = base->TCR2;
		val &= ~I2S_TCR2_SYNC_MASK;
		base->TCR2 = (val | I2S_TCR2_SYNC(0U));
		break;
	case kSAI_ModeSyncWithOtherTx:
		val = base->RCR2;
		val &= ~I2S_RCR2_SYNC_MASK;
		base->RCR2 = (val | I2S_RCR2_SYNC(2U));
		break;
	case kSAI_ModeSyncWithOtherRx:
		val = base->RCR2;
		val &= ~I2S_RCR2_SYNC_MASK;
		base->RCR2 = (val | I2S_RCR2_SYNC(3U));
		break;
	default:
		break;
	}
}

/*!
 * @brief  Sets the SAI Tx configuration structure to default values.
 *
 * This API initializes the configuration structure for use in SAI_TxConfig().
 * The initialized structure can remain unchanged in SAI_TxConfig(), or it can be modified
 *  before calling SAI_TxConfig().
 * This is an example.
   @code
   sai_config_t config;
   SAI_TxGetDefaultConfig(&config);
   @endcode
 *
 * @param config pointer to master configuration structure
 */
void i2s_tx_getdefaultconfig(sai_config_t *config)
{
	config->bclkSource = kSAI_BclkSourceMclkDiv;
	config->masterSlave = kSAI_Master;
	config->mclkSource = kSAI_MclkSourceSysclk;
	config->protocol = kSAI_BusLeftJustified;
	config->syncMode = kSAI_ModeAsync;
#if defined(FSL_FEATURE_SAI_HAS_MCR) && (FSL_FEATURE_SAI_HAS_MCR)
	config->mclkOutputEnable = true;
#endif /* FSL_FEATURE_SAI_HAS_MCR */
}

/*!
 * @brief  Sets the SAI Rx configuration structure to default values.
 *
 * This API initializes the configuration structure for use in SAI_RxConfig().
 * The initialized structure can remain unchanged in SAI_RxConfig() or it can be modified
 *  before calling SAI_RxConfig().
 * This is an example.
   @code
   sai_config_t config;
   SAI_RxGetDefaultConfig(&config);
   @endcode
 *
 * @param config pointer to master configuration structure
 */
void i2s_rx_getdefaultconfig(sai_config_t *config)
{
	config->bclkSource = kSAI_BclkSourceMclkDiv;
	config->masterSlave = kSAI_Master;
	config->mclkSource = kSAI_MclkSourceSysclk;
	config->protocol = kSAI_BusLeftJustified;
	config->syncMode = kSAI_ModeSync;
#if defined(FSL_FEATURE_SAI_HAS_MCR) && (FSL_FEATURE_SAI_HAS_MCR)
	config->mclkOutputEnable = true;
#endif /* FSL_FEATURE_SAI_HAS_MCR */
}

/*!
 * @brief De-initializes the SAI peripheral.
 *
 * This API gates the SAI clock. The SAI module can't operate unless SAI_TxInit
 * or SAI_RxInit is called to enable the clock.
 *
 * @param base SAI base pointer
*/
void i2s_deinit(I2S_Type *base)
{
	i2s_tx_enable(base, false);
	i2s_rx_enable(base, false);
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
	imxrt_clock_disableclock(s_saiClock[i2s_getinstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

/*! @} */

/*!
 * @name Bus Operations
 * @{
 */

/*!
 * @brief Configures the SAI Tx audio format.
 *
 * The audio format can be changed at run-time. This function configures the sample rate and audio data
 * format to be transferred.
 *
 * @param base SAI base pointer.
 * @param format Pointer to the SAI audio data format structure.
 * @param mclkSourceClockHz SAI master clock source frequency in Hz.
 * @param bclkSourceClockHz SAI bit clock source frequency in Hz. If the bit clock source is a master
 * clock, this value should equal the masterClockHz.
*/
void i2s_tx_setformat(I2S_Type *base,
		     sai_transfer_format_t *format,
		     uint32_t mclkSourceClockHz,
		     uint32_t bclkSourceClockHz)
{
	uint32_t bclk = 0;
	uint32_t val = 0;
	uint32_t channels = 2U;

