Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s.c
	if (format->stereo != kSAI_Stereo) {
		channels = 1U;
	}

	if (format->isFrameSyncCompact) {
		bclk = format->sampleRate_Hz * format->bitWidth * channels;
		val = (base->TCR4 & (~I2S_TCR4_SYWD_MASK));
		val |= I2S_TCR4_SYWD(format->bitWidth - 1U);
		base->TCR4 = val;
	} else {
		bclk = format->sampleRate_Hz * 32U * 2U;
	}

/* Compute the mclk */
#if defined(FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER) && (FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER)
	/* Check if master clock divider enabled, then set master clock divider */
	if (base->MCR & I2S_MCR_MOE_MASK) {
		i2s_setmasterclockdivider(base, format->masterClockHz, mclkSourceClockHz);
	}
#endif /* FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER */

	/* Set bclk if needed */
	if (base->TCR2 & I2S_TCR2_BCD_MASK) {
		base->TCR2 &= ~I2S_TCR2_DIV_MASK;
		base->TCR2 |= I2S_TCR2_DIV((bclkSourceClockHz / bclk) / 2U - 1U);
	}

	/* Set bitWidth */
	val = (format->isFrameSyncCompact) ? (format->bitWidth - 1) : 31U;
	if (format->protocol == kSAI_BusRightJustified) {
		base->TCR5 = I2S_TCR5_WNW(val) | I2S_TCR5_W0W(val) | I2S_TCR5_FBT(val);
	} else {
		base->TCR5 = I2S_TCR5_WNW(val) | I2S_TCR5_W0W(val) | I2S_TCR5_FBT(format->bitWidth - 1);
	}

	/* Set mono or stereo */
	base->TMR = (uint32_t)format->stereo;

	/* Set data channel */
	base->TCR3 &= ~I2S_TCR3_TCE_MASK;
	base->TCR3 |= I2S_TCR3_TCE(1U << format->channel);

#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	/* Set watermark */
	base->TCR1 = format->watermark;
#endif /* FSL_FEATURE_SAI_FIFO_COUNT  */
}

/*!
 * @brief Configures the SAI Rx audio format.
 *
 * The audio format can be changed at run-time. This function configures the sample rate and audio data
 * format to be transferred.
 *
 * @param base SAI base pointer.
 * @param format Pointer to the SAI audio data format structure.
 * @param mclkSourceClockHz SAI master clock source frequency in Hz.
 * @param bclkSourceClockHz SAI bit clock source frequency in Hz. If the bit clock source is a master
 * clock, this value should equal the masterClockHz.
*/
void i2s_rx_setformat(I2S_Type *base,
		     sai_transfer_format_t *format,
		     uint32_t mclkSourceClockHz,
		     uint32_t bclkSourceClockHz)
{
	uint32_t bclk = 0;
	uint32_t val = 0;
	uint32_t channels = 2U;

	if (format->stereo != kSAI_Stereo) {
		channels = 1U;
	}

	if (format->isFrameSyncCompact) {
		bclk = format->sampleRate_Hz * format->bitWidth * channels;
		val = (base->RCR4 & (~I2S_RCR4_SYWD_MASK));
		val |= I2S_RCR4_SYWD(format->bitWidth - 1U);
		base->RCR4 = val;
	} else {
		bclk = format->sampleRate_Hz * 32U * 2U;
	}

/* Compute the mclk */
#if defined(FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER) && (FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER)
	/* Check if master clock divider enabled */
	if (base->MCR & I2S_MCR_MOE_MASK) {
		i2s_setmasterclockdivider(base, format->masterClockHz, mclkSourceClockHz);
	}
#endif /* FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER */

	/* Set bclk if needed */
	if (base->RCR2 & I2S_RCR2_BCD_MASK) {
		base->RCR2 &= ~I2S_RCR2_DIV_MASK;
		base->RCR2 |= I2S_RCR2_DIV((bclkSourceClockHz / bclk) / 2U - 1U);
	}

	/* Set bitWidth */
	val = (format->isFrameSyncCompact) ? (format->bitWidth - 1) : 31U;
	if (format->protocol == kSAI_BusRightJustified) {
		base->RCR5 = I2S_RCR5_WNW(val) | I2S_RCR5_W0W(val) | I2S_RCR5_FBT(val);
	} else {
		base->RCR5 = I2S_RCR5_WNW(val) | I2S_RCR5_W0W(val) | I2S_RCR5_FBT(format->bitWidth - 1);
	}

	/* Set mono or stereo */
	base->RMR = (uint32_t)format->stereo;

	/* Set data channel */
	base->RCR3 &= ~I2S_RCR3_RCE_MASK;
	base->RCR3 |= I2S_RCR3_RCE(1U << format->channel);

#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	/* Set watermark */
	base->RCR1 = format->watermark;
#endif /* FSL_FEATURE_SAI_FIFO_COUNT  */
}

/*!
 * @brief Sends data using a blocking method.
 *
 * @note This function blocks by polling until data is ready to be sent.
 *
 * @param base SAI base pointer.
 * @param channel Data channel used.
 * @param bitWidth How many bits in an audio word; usually 8/16/24/32 bits.
 * @param buffer Pointer to the data to be written.
 * @param size Bytes to be written.
 */
void i2s_write_blocking(I2S_Type *base, uint32_t channel, uint32_t bitWidth, uint8_t *buffer, uint32_t size)
{
	uint32_t i = 0;
	uint8_t bytesPerWord = bitWidth / 8U;

	while (i < size) {
		/* Wait until it can write data */
		while (!(base->TCSR & I2S_TCSR_FWF_MASK)) {
		}

		i2s_write_nonblocking(base, channel, bitWidth, buffer, bytesPerWord);
		buffer += bytesPerWord;
		i += bytesPerWord;
	}

	/* Wait until the last data is sent */
	while (!(base->TCSR & I2S_TCSR_FWF_MASK)) {
	}
}

/*!
 * @brief Writes data into SAI FIFO.
 *
 * @param base SAI base pointer.
 * @param channel Data channel used.
 * @param data Data needs to be written.
 */
static inline void i2s_writedata(I2S_Type *base, uint32_t channel, uint32_t data)
{
	base->TDR[channel] = data;
}

/*!
 * @brief Receives data using a blocking method.
 *
 * @note This function blocks by polling until data is ready to be sent.
 *
 * @param base SAI base pointer.
 * @param channel Data channel used.
 * @param bitWidth How many bits in an audio word; usually 8/16/24/32 bits.
 * @param buffer Pointer to the data to be read.
 * @param size Bytes to be read.
 */
void i2s_read_blocking(I2S_Type *base, uint32_t channel, uint32_t bitWidth, uint8_t *buffer, uint32_t size)
{
	uint32_t i = 0;
	uint8_t bytesPerWord = bitWidth / 8U;

	while (i < size) {
		/* Wait until data is received */
		while (!(base->RCSR & I2S_RCSR_FWF_MASK)) {
		}

		i2s_read_nonblocking(base, channel, bitWidth, buffer, bytesPerWord);
		buffer += bytesPerWord;
		i += bytesPerWord;
	}
}

/*!
 * @brief Reads data from the SAI FIFO.
 *
 * @param base SAI base pointer.
 * @param channel Data channel used.
 * @return Data in SAI FIFO.
 */
static inline uint32_t i2s_readdata(I2S_Type *base, uint32_t channel)
{
	return base->RDR[channel];
}

/*! @} */

/*!
 * @name Transactional
 * @{
 */
/*!
 * @brief Configures the SAI Tx audio format.
 *
 * The audio format can be changed at run-time. This function configures the sample rate and audio data
 * format to be transferred.
 *
 * @param base SAI base pointer.
 * @param handle SAI handle pointer.
 * @param format Pointer to the SAI audio data format structure.
 * @param mclkSourceClockHz SAI master clock source frequency in Hz.
 * @param bclkSourceClockHz SAI bit clock source frequency in Hz. If a bit clock source is a master
 * clock, this value should equal the masterClockHz in format.
 * @return Status of this function. Return value is the status_t.
*/
status_t i2s_transfer_tx_setformat(I2S_Type *base,
				 sai_handle_t *handle,
				 sai_transfer_format_t *format,
				 uint32_t mclkSourceClockHz,
				 uint32_t bclkSourceClockHz)
{
	DEBUGASSERT(handle);

	if ((mclkSourceClockHz < format->sampleRate_Hz) || (bclkSourceClockHz < format->sampleRate_Hz)) {
		return kStatus_InvalidArgument;
	}

