Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s.c
	/* Copy format to handle */
	handle->bitWidth = format->bitWidth;
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	handle->watermark = format->watermark;
#endif
	handle->channel = format->channel;

	i2s_tx_setformat(base, format, mclkSourceClockHz, bclkSourceClockHz);

	return kStatus_Success;
}

/*!
 * @brief Configures the SAI Rx audio format.
 *
 * The audio format can be changed at run-time. This function configures the sample rate and audio data
 * format to be transferred.
 *
 * @param base SAI base pointer.
 * @param handle SAI handle pointer.
 * @param format Pointer to the SAI audio data format structure.
 * @param mclkSourceClockHz SAI master clock source frequency in Hz.
 * @param bclkSourceClockHz SAI bit clock source frequency in Hz. If a bit clock source is a master
 * clock, this value should equal the masterClockHz in format.
 * @return Status of this function. Return value is one of status_t.
*/
status_t i2s_transfer_rx_setformat(I2S_Type *base,
				 sai_handle_t *handle,
				 sai_transfer_format_t *format,
				 uint32_t mclkSourceClockHz,
				 uint32_t bclkSourceClockHz)
{
	DEBUGASSERT(handle);

	if ((mclkSourceClockHz < format->sampleRate_Hz) || (bclkSourceClockHz < format->sampleRate_Hz)) {
		return kStatus_InvalidArgument;
	}

	/* Copy format to handle */
	handle->bitWidth = format->bitWidth;
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	handle->watermark = format->watermark;
#endif
	handle->channel = format->channel;

	i2s_rx_setformat(base, format, mclkSourceClockHz, bclkSourceClockHz);

	return kStatus_Success;
}

/*!
 * @brief Performs an interrupt non-blocking send transfer on SAI.
 *
 * @note This API returns immediately after the transfer initiates.
 * Call the SAI_TxGetTransferStatusIRQ to poll the transfer status and check whether
 * the transfer is finished. If the return status is not kStatus_SAI_Busy, the transfer
 * is finished.
 *
 * @param base SAI base pointer.
 * @param handle Pointer to the sai_handle_t structure which stores the transfer state.
 * @param xfer Pointer to the sai_transfer_t structure.
 * @retval kStatus_Success Successfully started the data receive.
 * @retval kStatus_SAI_TxBusy Previous receive still not finished.
 * @retval kStatus_InvalidArgument The input parameter is invalid.
 */
status_t i2s_transfer_send_nonblocking(I2S_Type *base, sai_handle_t *handle, sai_transfer_t *xfer)
{
	DEBUGASSERT(handle);

	/* Check if the queue is full */
	if (handle->saiQueue[handle->queueUser].data) {
		return kStatus_SAI_QueueFull;
	}

	/* Add into queue */
	handle->transferSize[handle->queueUser] = xfer->dataSize;
	handle->saiQueue[handle->queueUser].data = xfer->data;
	handle->saiQueue[handle->queueUser].dataSize = xfer->dataSize;
	handle->queueUser = (handle->queueUser + 1) % SAI_XFER_QUEUE_SIZE;

	/* Set the state to busy */
	handle->state = kSAI_Busy;

/* Enable interrupt */
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	/* Use FIFO request interrupt and fifo error*/
	i2s_tx_enableinterrupts(base, kSAI_FIFOErrorInterruptEnable | kSAI_FIFORequestInterruptEnable);
#else
	i2s_tx_enableinterrupts(base, kSAI_FIFOErrorInterruptEnable | kSAI_FIFOWarningInterruptEnable);
#endif /* FSL_FEATURE_SAI_FIFO_COUNT */

	/* Enable Tx transfer */
	i2s_tx_enable(base, true);

	return kStatus_Success;
}

/*!
 * @brief Performs an interrupt non-blocking receive transfer on SAI.
 *
 * @note This API returns immediately after the transfer initiates.
 * Call the SAI_RxGetTransferStatusIRQ to poll the transfer status and check whether
 * the transfer is finished. If the return status is not kStatus_SAI_Busy, the transfer
 * is finished.
 *
 * @param base SAI base pointer
 * @param handle Pointer to the sai_handle_t structure which stores the transfer state.
 * @param xfer Pointer to the sai_transfer_t structure.
 * @retval kStatus_Success Successfully started the data receive.
 * @retval kStatus_SAI_RxBusy Previous receive still not finished.
 * @retval kStatus_InvalidArgument The input parameter is invalid.
 */
status_t i2s_transfer_receive_nonblocking(I2S_Type *base, sai_handle_t *handle, sai_transfer_t *xfer)
{
	DEBUGASSERT(handle);

	/* Check if the queue is full */
	if (handle->saiQueue[handle->queueUser].data) {
		return kStatus_SAI_QueueFull;
	}

	/* Add into queue */
	handle->transferSize[handle->queueUser] = xfer->dataSize;
	handle->saiQueue[handle->queueUser].data = xfer->data;
	handle->saiQueue[handle->queueUser].dataSize = xfer->dataSize;
	handle->queueUser = (handle->queueUser + 1) % SAI_XFER_QUEUE_SIZE;

	/* Set state to busy */
	handle->state = kSAI_Busy;

/* Enable interrupt */
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	/* Use FIFO request interrupt and fifo error*/
	i2s_rx_enableinterrupts(base, kSAI_FIFOErrorInterruptEnable | kSAI_FIFORequestInterruptEnable);
#else
	i2s_rx_enableinterrupts(base, kSAI_FIFOErrorInterruptEnable | kSAI_FIFOWarningInterruptEnable);
#endif /* FSL_FEATURE_SAI_FIFO_COUNT */

	/* Enable Rx transfer */
	i2s_rx_enable(base, true);

	return kStatus_Success;
}

/*!
 * @brief Gets a set byte count.
 *
 * @param base SAI base pointer.
 * @param handle Pointer to the sai_handle_t structure which stores the transfer state.
 * @param count Bytes count sent.
 * @retval kStatus_Success Succeed get the transfer count.
 * @retval kStatus_NoTransferInProgress There is not a non-blocking transaction currently in progress.
 */
status_t i2s_transfer_getsendcount(I2S_Type *base, sai_handle_t *handle, size_t *count)
{
	DEBUGASSERT(handle);

	status_t status = kStatus_Success;

	if (handle->state != kSAI_Busy) {
		status = kStatus_NoTransferInProgress;
	} else {
		*count = (handle->transferSize[handle->queueDriver] - handle->saiQueue[handle->queueDriver].dataSize);
	}

	return status;
}

/*!
 * @brief Gets a received byte count.
 *
 * @param base SAI base pointer.
 * @param handle Pointer to the sai_handle_t structure which stores the transfer state.
 * @param count Bytes count received.
 * @retval kStatus_Success Succeed get the transfer count.
 * @retval kStatus_NoTransferInProgress There is not a non-blocking transaction currently in progress.
 */
status_t i2s_transfer_getreceivecount(I2S_Type *base, sai_handle_t *handle, size_t *count)
{
	DEBUGASSERT(handle);

