Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s.c
	status_t status = kStatus_Success;

	if (handle->state != kSAI_Busy) {
		status = kStatus_NoTransferInProgress;
	} else {
		*count = (handle->transferSize[handle->queueDriver] - handle->saiQueue[handle->queueDriver].dataSize);
	}

	return status;
}

/*!
 * @brief Aborts the current send.
 *
 * @note This API can be called any time when an interrupt non-blocking transfer initiates
 * to abort the transfer early.
 *
 * @param base SAI base pointer.
 * @param handle Pointer to the sai_handle_t structure which stores the transfer state.
 */
void i2s_transfer_abortsend(I2S_Type *base, sai_handle_t *handle)
{
	DEBUGASSERT(handle);

	/* Stop Tx transfer and disable interrupt */
	i2s_tx_enable(base, false);
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	/* Use FIFO request interrupt and fifo error */
	i2s_tx_disableinterrupts(base, kSAI_FIFOErrorInterruptEnable | kSAI_FIFORequestInterruptEnable);
#else
	i2s_tx_disableinterrupts(base, kSAI_FIFOErrorInterruptEnable | kSAI_FIFOWarningInterruptEnable);
#endif /* FSL_FEATURE_SAI_FIFO_COUNT */

	handle->state = kSAI_Idle;

	/* Clear the queue */
	memset(handle->saiQueue, 0, sizeof(sai_transfer_t) * SAI_XFER_QUEUE_SIZE);
	handle->queueDriver = 0;
	handle->queueUser = 0;
}

/*!
 * @brief Aborts the current IRQ receive.
 *
 * @note This API can be called when an interrupt non-blocking transfer initiates
 * to abort the transfer early.
 *
 * @param base SAI base pointer
 * @param handle Pointer to the sai_handle_t structure which stores the transfer state.
 */
void i2s_transfer_abortreceive(I2S_Type *base, sai_handle_t *handle)
{
	DEBUGASSERT(handle);

	/* Stop Tx transfer and disable interrupt */
	i2s_rx_enable(base, false);
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	/* Use FIFO request interrupt and fifo error */
	i2s_rx_disableinterrupts(base, kSAI_FIFOErrorInterruptEnable | kSAI_FIFORequestInterruptEnable);
#else
	i2s_rx_disableinterrupts(base, kSAI_FIFOErrorInterruptEnable | kSAI_FIFOWarningInterruptEnable);
#endif /* FSL_FEATURE_SAI_FIFO_COUNT */

	handle->state = kSAI_Idle;

	/* Clear the queue */
	memset(handle->saiQueue, 0, sizeof(sai_transfer_t) * SAI_XFER_QUEUE_SIZE);
	handle->queueDriver = 0;
	handle->queueUser = 0;
}

/*!
 * @brief Terminate all SAI send.
 *
 * This function will clear all transfer slots buffered in the sai queue. If users only want to abort the
 * current transfer slot, please call SAI_TransferAbortSend.
 *
 * @param base SAI base pointer.
 * @param handle SAI eDMA handle pointer.
 */
void i2s_transferterminatesend(I2S_Type *base, sai_handle_t *handle)
{
	DEBUGASSERT(handle);

	/* Abort the current transfer */
	i2s_transfer_abortsend(base, handle);

	/* Clear all the internal information */
	memset(handle->saiQueue, 0U, sizeof(handle->saiQueue));
	memset(handle->transferSize, 0U, sizeof(handle->transferSize));
	handle->queueUser = 0U;
	handle->queueDriver = 0U;
}

/*!
 * @brief Terminate all SAI receive.
 *
 * This function will clear all transfer slots buffered in the sai queue. If users only want to abort the
 * current transfer slot, please call SAI_TransferAbortReceive.
 *
 * @param base SAI base pointer.
 * @param handle SAI eDMA handle pointer.
 */
void i2s_transferterminatereceive(I2S_Type *base, sai_handle_t *handle)
{
	DEBUGASSERT(handle);

	/* Abort the current transfer */
	i2s_transfer_abortreceive(base, handle);

	/* Clear all the internal information */
	memset(handle->saiQueue, 0U, sizeof(handle->saiQueue));
	memset(handle->transferSize, 0U, sizeof(handle->transferSize));
	handle->queueUser = 0U;
	handle->queueDriver = 0U;
}

/*!
 * @brief Tx interrupt handler.
 *
 * @param base SAI base pointer.
 * @param handle Pointer to the sai_handle_t structure.
 */
void i2s_transfer_tx_handleirq(I2S_Type *base, sai_handle_t *handle)
{
	DEBUGASSERT(handle);

	uint8_t *buffer = handle->saiQueue[handle->queueDriver].data;
	uint8_t dataSize = handle->bitWidth / 8U;

	/* Handle Error */
	if (base->TCSR & I2S_TCSR_FEF_MASK) {
		/* Clear FIFO error flag to continue transfer */
		i2s_tx_clearstatusflag(base, kSAI_FIFOErrorFlag);

		/* Reset FIFO for safety */
		i2s_tx_softwarereset(base, kSAI_ResetTypeFIFO);

		/* Call the callback */
		if (handle->callbackParam[handle->queueDriver].callback) {
			(handle->callbackParam[handle->queueDriver].callback)((FAR struct i2s_dev_s *)handle->callbackParam[handle->queueDriver].dev_ptr, handle->callbackParam[handle->queueDriver].apb, handle->callbackParam[handle->queueDriver].arg, -1);
		}
	}

/* Handle transfer */
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	if (base->TCSR & I2S_TCSR_FRF_MASK) {
		/* Judge if the data need to transmit is less than space */
		uint8_t size = MIN((handle->saiQueue[handle->queueDriver].dataSize),
				   (size_t)((FSL_FEATURE_SAI_FIFO_COUNT - handle->watermark) * dataSize));

		/* Copy the data from sai buffer to FIFO */
		i2s_write_nonblocking(base, handle->channel, handle->bitWidth, buffer, size);

		/* Update the internal counter */
		handle->saiQueue[handle->queueDriver].dataSize -= size;
		handle->saiQueue[handle->queueDriver].data += size;
	}
#else
	if (base->TCSR & I2S_TCSR_FWF_MASK) {
		uint8_t size = MIN((handle->saiQueue[handle->queueDriver].dataSize), dataSize);

		i2s_write_nonblocking(base, handle->channel, handle->bitWidth, buffer, size);

		/* Update internal counter */
		handle->saiQueue[handle->queueDriver].dataSize -= size;
		handle->saiQueue[handle->queueDriver].data += size;
	}
#endif /* FSL_FEATURE_SAI_FIFO_COUNT */

	/* If finished a blcok, call the callback function */
	if (handle->saiQueue[handle->queueDriver].dataSize == 0U) {
		memset(&handle->saiQueue[handle->queueDriver], 0, sizeof(sai_transfer_t));
		handle->queueDriver = (handle->queueDriver + 1) % SAI_XFER_QUEUE_SIZE;

		/* Call the callback */
		if (handle->callbackParam[handle->queueDriver].callback) {
			(handle->callbackParam[handle->queueDriver].callback)((FAR struct i2s_dev_s *)handle->callbackParam[handle->queueDriver].dev_ptr, handle->callbackParam[handle->queueDriver].apb, handle->callbackParam[handle->queueDriver].arg, OK);
		}
	}

	/* If all data finished, just stop the transfer */
	if (handle->saiQueue[handle->queueDriver].data == NULL) {
		i2s_transfer_abortsend(base, handle);
	}
}

/*!
 * @brief Tx interrupt handler.
 *
 * @param base SAI base pointer.
 * @param handle Pointer to the sai_handle_t structure.
 */
void i2s_transfer_rx_handleirq(I2S_Type *base, sai_handle_t *handle)
{
	DEBUGASSERT(handle);

	uint8_t *buffer = handle->saiQueue[handle->queueDriver].data;
	uint8_t dataSize = handle->bitWidth / 8U;

