Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s.c
	/* Handle Error */
	if (base->RCSR & I2S_RCSR_FEF_MASK) {
		/* Clear FIFO error flag to continue transfer */
		i2s_rx_clearstatusflags(base, kSAI_FIFOErrorFlag);

		/* Reset FIFO for safety */
		i2s_rx_softwarereset(base, kSAI_ResetTypeFIFO);

		/* Call the callback */
		if (handle->callbackParam[handle->queueDriver].callback) {
			(handle->callbackParam[handle->queueDriver].callback)((FAR struct i2s_dev_s *)handle->callbackParam[handle->queueDriver].dev_ptr, handle->callbackParam[handle->queueDriver].apb, handle->callbackParam[handle->queueDriver].arg, -1);
		}
	}

/* Handle transfer */
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	if (base->RCSR & I2S_RCSR_FRF_MASK) {
		/* Judge if the data need to transmit is less than space */
		uint8_t size = MIN((handle->saiQueue[handle->queueDriver].dataSize), (handle->watermark * dataSize));

		/* Copy the data from sai buffer to FIFO */
		i2s_read_nonblocking(base, handle->channel, handle->bitWidth, buffer, size);

		/* Update the internal counter */
		handle->saiQueue[handle->queueDriver].dataSize -= size;
		handle->saiQueue[handle->queueDriver].data += size;
	}
#else
	if (base->RCSR & I2S_RCSR_FWF_MASK) {
		uint8_t size = MIN((handle->saiQueue[handle->queueDriver].dataSize), dataSize);

		i2s_read_nonblocking(base, handle->channel, handle->bitWidth, buffer, size);

		/* Update internal state */
		handle->saiQueue[handle->queueDriver].dataSize -= size;
		handle->saiQueue[handle->queueDriver].data += size;
	}
#endif /* FSL_FEATURE_SAI_FIFO_COUNT */

	/* If finished a blcok, call the callback function */
	if (handle->saiQueue[handle->queueDriver].dataSize == 0U) {
		memset(&handle->saiQueue[handle->queueDriver], 0, sizeof(sai_transfer_t));
		handle->queueDriver = (handle->queueDriver + 1) % SAI_XFER_QUEUE_SIZE;

		/* Call the callback */
		if (handle->callbackParam[handle->queueDriver].callback) {
			(handle->callbackParam[handle->queueDriver].callback)((FAR struct i2s_dev_s *)handle->callbackParam[handle->queueDriver].dev_ptr, handle->callbackParam[handle->queueDriver].apb, handle->callbackParam[handle->queueDriver].arg, OK);
		}
	}

	/* If all data finished, just stop the transfer */
	if (handle->saiQueue[handle->queueDriver].data == NULL) {
		i2s_transfer_abortreceive(base, handle);
	}
}

/*! @} */

/****************************************************************************
 * Name: i2s_exclsem_take
 *
 * Description:
 *   Take the exclusive access semaphore handling any exceptional conditions
 *
 * Input Parameters:
 *   priv - A reference to the I2S peripheral state
 *
 * Returned Value:
 *  None
 *
 ****************************************************************************/

static void i2s_exclsem_take(struct imxrt_i2s_s *priv)
{
	int ret;

	/* Wait until we successfully get the semaphore.  EINTR is the only
	 * expected 'failure' (meaning that the wait for the semaphore was
	 * interrupted by a signal.
	 */
	do {
		ret = sem_wait(&priv->exclsem);
		DEBUGASSERT(ret == 0 || errno == EINTR);
	} while (ret < 0);
}

/****************************************************************************
 * Name: i2s_rxdatawidth
 *
 * Description:
 *   Set the I2S RX data width.  The RX bitrate is determined by
 *   sample_rate * data_width.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   width - The I2S data with in bits.
 *
 * Returned Value:
 *   Returns the resulting bitrate
 *
 ****************************************************************************/

static uint32_t i2s_rxdatawidth(struct i2s_dev_s *dev, int bits)
{
#if defined(I2S_HAVE_RX) && (0 < I2S_HAVE_RX)
	struct imxrt_i2s_s *priv = (struct imxrt_i2s_s *)dev;
	int ret;

	/* Support 16/32bits only */
	DEBUGASSERT(priv && (bits == I2S_BITS_PER_SAMPLE_16BIT || bits == I2S_BITS_PER_SAMPLE_32BIT));

	if (bits == I2S_BITS_PER_SAMPLE_16BIT || bits == I2S_BITS_PER_SAMPLE_32BIT) {
		priv->bits_per_sample = bits;
		ret = i2s_set_clk(priv, priv->sample_rate, priv->bits_per_sample, priv->channel_num);
		if (ret == OK) {
			return priv->bits_per_sample * priv->sample_rate;
		}
	}
#endif

	return 0;
}

/****************************************************************************
 * Name: i2s_receive
 *
 * Description:
 *   Receive a block of data from I2S.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   apb      - A pointer to the audio buffer in which to recieve data
 *   callback - A user provided callback function that will be called at
 *              the completion of the transfer.  The callback will be
 *              performed in the context of the worker thread.
 *   arg      - An opaque argument that will be provided to the callback
 *              when the transfer complete
 *   timeout  - The timeout value to use.  The transfer will be canceled
 *              and an ETIMEDOUT error will be reported if this timeout
 *              elapsed without completion of the DMA transfer.  Units
 *              are system clock ticks.  Zero means no timeout.
 *
 * Returned Value:
 *   OK on success; a negated errno value on failure.  NOTE:  This function
 *   only enqueues the transfer and returns immediately.  Success here only
 *   means that the transfer was enqueued correctly.
 *
 *   When the transfer is complete, a 'result' value will be provided as
 *   an argument to the callback function that will indicate if the transfer
 *   failed.
 *
 ****************************************************************************/

static int i2s_receive(struct i2s_dev_s *dev, struct ap_buffer_s *apb, i2s_callback_t callback, void *arg, uint32_t timeout)
{
	struct imxrt_i2s_s *priv = (struct imxrt_i2s_s *)dev;

	i2sinfo("[I2S RX] apb=%p nmaxbytes=%d samp=%p arg=%p timeout=%d\n", apb, apb->nmaxbytes, apb->samp, arg, timeout);

#if defined(I2S_HAVE_RX) && (0 < I2S_HAVE_RX)
	/* Has the RX channel been enabled? */
	if (!priv->rxenab) {
		i2serr("ERROR: I2S has no receiver\n");
		return -EAGAIN;
	}

	/* Check if the queue is full */
	if (priv->si_rx_handle.saiQueue[priv->si_rx_handle.queueUser].data) {
		return -EAGAIN;
	}

	/* Get exclusive access to the I2S driver data */
	i2s_exclsem_take(priv);
	i2sinfo("RX Exclusive Enter\n");

