Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s.c
	priv->si_rx_handle.transferSize[priv->si_rx_handle.queueUser] = apb->nmaxbytes;
	priv->si_rx_handle.saiQueue[priv->si_rx_handle.queueUser].data = apb->samp;;
	priv->si_rx_handle.saiQueue[priv->si_rx_handle.queueUser].dataSize = apb->nmaxbytes;
	priv->si_rx_handle.callbackParam[priv->si_rx_handle.queueUser].dev_ptr = (void *)dev;
	priv->si_rx_handle.callbackParam[priv->si_rx_handle.queueUser].apb = apb;
	priv->si_rx_handle.callbackParam[priv->si_rx_handle.queueUser].arg = arg;
	priv->si_rx_handle.callbackParam[priv->si_rx_handle.queueUser].callback = callback;
	priv->si_rx_handle.callbackParam[priv->si_rx_handle.queueUser].timeout = timeout;
	priv->si_rx_handle.queueUser = (priv->si_rx_handle.queueUser + 1) % SAI_XFER_QUEUE_SIZE;

	/* Set state to busy */
	priv->si_rx_handle.state = kSAI_Busy;

	/* Enable interrupt */
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	/* Use FIFO request interrupt and fifo error*/
	i2s_rx_enableinterrupts(priv->i2s_base, kSAI_FIFOErrorInterruptEnable | kSAI_FIFORequestInterruptEnable);
#else
	i2s_rx_enableinterrupts(priv->i2s_base, kSAI_FIFOErrorInterruptEnable | kSAI_FIFOWarningInterruptEnable);
#endif /* FSL_FEATURE_SAI_FIFO_COUNT */

	/* Enable Rx transfer */
	i2s_rx_enable(priv->i2s_base, true);

	/* Exit this function */
	i2s_exclsem_give(priv);
	i2sinfo("RX Exclusive Exit\n");

	return OK;

#else
	i2serr("ERROR: I2S has no receiver\n");
	UNUSED(priv);
	return -ENOSYS;
#endif

}

/****************************************************************************
 * Name: i2s_txdatawidth
 *
 * Description:
 *   Set the I2S TX data width.  The TX bitrate is determined by
 *   sample_rate * data_width.
 *
 * Input Parameters:
 *   dev   - Device-specific state data
 *   width - The I2S data with in bits.
 *
 * Returned Value:
 *   Returns the resulting bitrate
 *
 ****************************************************************************/

static uint32_t i2s_txdatawidth(struct i2s_dev_s *dev, int bits)
{
#if defined(I2S_HAVE_TX) && (0 < I2S_HAVE_TX)
	struct imxrt_i2s_s *priv = (struct imxrt_i2s_s *)dev;
	int ret;
	/* Support 16/32bits only */
	DEBUGASSERT(priv && (bits == I2S_BITS_PER_SAMPLE_16BIT || bits == I2S_BITS_PER_SAMPLE_32BIT));

	if (bits == I2S_BITS_PER_SAMPLE_16BIT || bits == I2S_BITS_PER_SAMPLE_32BIT) {
		priv->bits_per_sample = bits;

		if (bits == I2S_BITS_PER_SAMPLE_16BIT || bits == I2S_BITS_PER_SAMPLE_32BIT) {
			priv->bits_per_sample = bits;
			ret = i2s_set_clk(priv, priv->sample_rate, priv->bits_per_sample, priv->channel_num);
			if (ret == OK) {
				return priv->bits_per_sample * priv->sample_rate;
			}
		}
	}
#endif

	return 0;
}

/****************************************************************************
* Name: i2s_send
*
* Description:
*   Send a block of data on I2S.
*
* Input Parameters:
*   dev      - Device-specific state data
*   apb      - A pointer to the audio buffer from which to send data
*   callback - A user provided callback function that will be called at
*              the completion of the transfer.  The callback will be
*              performed in the context of the worker thread.
*   arg      - An opaque argument that will be provided to the callback
*              when the transfer complete
*   timeout  - The timeout value to use.  The transfer will be canceled
*              and an ETIMEDOUT error will be reported if this timeout
*              elapsed without completion of the DMA transfer.  Units
*              are system clock ticks.  Zero means no timeout.
*
* Returned Value:
*   OK on success; a negated errno value on failure.  NOTE:  This function
*   only enqueues the transfer and returns immediately.  Success here only
*   means that the transfer was enqueued correctly.
*
*   When the transfer is complete, a 'result' value will be provided as
*   an argument to the callback function that will indicate if the transfer
*   failed.
*
****************************************************************************/

static int i2s_send(struct i2s_dev_s *dev, struct ap_buffer_s *apb, i2s_callback_t callback, void *arg, uint32_t timeout)
{
	struct imxrt_i2s_s *priv = (struct imxrt_i2s_s *)dev;

	DEBUGASSERT(priv && apb);

	i2sinfo("[I2S TX] apb=%p nbytes=%d arg=%p samp=%p timeout=%d\n", apb, apb->nbytes - apb->curbyte, apb->samp, arg, timeout);

	i2s_dump_buffer("Sending", &apb->samp[apb->curbyte], apb->nbytes - apb->curbyte);

#if defined(I2S_HAVE_TX) && (0 < I2S_HAVE_TX)

	/* Has the TX channel been enabled? */
	if (!priv->txenab) {
		i2serr("ERROR: I2S has no transmitter\n");
		return -EAGAIN;
	}

	/* Check if the queue is full */
	if (priv->si_tx_handle.saiQueue[priv->si_tx_handle.queueUser].data) {
		return kStatus_SAI_QueueFull;
	}

	/* Get exclusive access to the I2S driver data */
	i2s_exclsem_take(priv);
	i2sinfo("TX Exclusive Enter\n");

	/* Add into queue */
	priv->si_tx_handle.transferSize[priv->si_tx_handle.queueUser] = apb->nbytes - apb->curbyte;
	priv->si_tx_handle.saiQueue[priv->si_tx_handle.queueUser].data = &apb->samp[apb->curbyte];
	priv->si_tx_handle.saiQueue[priv->si_tx_handle.queueUser].dataSize = apb->nbytes - apb->curbyte;
	priv->si_tx_handle.callbackParam[priv->si_tx_handle.queueUser].dev_ptr = (void *)dev;
	priv->si_tx_handle.callbackParam[priv->si_tx_handle.queueUser].apb = apb;
	priv->si_tx_handle.callbackParam[priv->si_tx_handle.queueUser].arg = arg;
	priv->si_tx_handle.callbackParam[priv->si_tx_handle.queueUser].callback = callback;
	priv->si_tx_handle.callbackParam[priv->si_tx_handle.queueUser].timeout = timeout;
	priv->si_tx_handle.queueUser = (priv->si_tx_handle.queueUser + 1) % SAI_XFER_QUEUE_SIZE;

	/* Set the state to busy */
	priv->si_tx_handle.state = kSAI_Busy;

	/* Enable interrupt */
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	/* Use FIFO request interrupt and fifo error*/
	i2s_tx_enableinterrupts(priv->i2s_base, kSAI_FIFOErrorInterruptEnable | kSAI_FIFORequestInterruptEnable);
#else
	i2s_tx_enableinterrupts(priv->i2s_base, kSAI_FIFOErrorInterruptEnable | kSAI_FIFOWarningInterruptEnable);
#endif /* FSL_FEATURE_SAI_FIFO_COUNT */

	/* Enable Tx transfer */
	i2s_tx_enable(priv->i2s_base, true);

	i2s_exclsem_give(priv);
	i2sinfo("TX Exclusive Exit\n");

	return OK;
#else
	i2serr("ERROR: I2S has no transmitter\n");
	UNUSED(priv);
	return -ENOSYS;
#endif
}

/****************************************************************************
* Name: i2s_pause
*
* Description:
*   Pause data transfer on I2S.
*
* Input Parameters:
*   dev      - Device-specific state data
*   dir      - the data flow direction of I2S
*
* Returned Value:
*   OK on success;
*
****************************************************************************/
static int i2s_pause(struct i2s_dev_s *dev, i2s_ch_dir_t dir)
{
	struct imxrt_i2s_s *priv = (struct imxrt_i2s_s *)dev;
	DEBUGASSERT(priv);

#if defined(I2S_HAVE_TX) && (0 < I2S_HAVE_TX)
	if (dir == I2S_TX && priv->txenab) {
		i2s_tx_enable(priv->i2s_base, false);
	}
#endif

#if defined(I2S_HAVE_RX) && (0 < I2S_HAVE_RX)
	if (dir == I2S_RX && priv->rxenab) {
		i2s_rx_enable(priv->i2s_base, false);
	}
#endif

	return OK;
}

/****************************************************************************
* Name: i2s_resume
*
* Description:
*   Resume data transfer on I2S if it is paused.
*
* Input Parameters:
*   dev      - Device-specific state data
*   dir      - the data flow direction of I2S
*
* Returned Value:
*   OK on success;
*
****************************************************************************/
static int i2s_resume(struct i2s_dev_s *dev, i2s_ch_dir_t dir)
{
	struct imxrt_i2s_s *priv = (struct imxrt_i2s_s *)dev;
	DEBUGASSERT(priv);

#if defined(I2S_HAVE_TX) && (0 < I2S_HAVE_TX)
	if (dir == I2S_TX && priv->txenab) {
		i2s_tx_enable(priv->i2s_base, true);
	}
#endif

#if defined(I2S_HAVE_RX) && (0 < I2S_HAVE_RX)
	if (dir == I2S_RX && priv->rxenab) {
		i2s_rx_enable(priv->i2s_base, true);
	}
#endif

