Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s.c
	return 0;
}

/****************************************************************************
* Name: i2s_stop
*
* Description:
*   stop i2s transferring
*
* Input Parameters:
*   dev     - device handler
*   dir     - transferring direction
*
* Returned Value:
*  OK
*
****************************************************************************/
static int i2s_stop_transfer(struct i2s_dev_s *dev, i2s_ch_dir_t dir)
{
	struct imxrt_i2s_s *priv = (struct imxrt_i2s_s *)dev;
	DEBUGASSERT(priv);

#if defined(I2S_HAVE_TX) && (0 < I2S_HAVE_TX)
	if (dir == I2S_TX) {
		i2s_transfer_abortsend(priv->i2s_base, &priv->si_tx_handle);
	}
#endif

#if defined(I2S_HAVE_RX) && (0 < I2S_HAVE_RX)
	if (dir == I2S_RX) {
		i2s_transfer_abortreceive(priv->i2s_base, &priv->si_rx_handle);
	}
#endif

	return 0;
}

static int i2s_stop(struct i2s_dev_s *dev, i2s_ch_dir_t dir)
{
	struct imxrt_i2s_s *priv = (struct imxrt_i2s_s *)dev;
	DEBUGASSERT(priv);

	i2s_exclsem_take(priv);

#if defined(I2S_HAVE_TX) && (0 < I2S_HAVE_TX)
	if (dir == I2S_TX) {
		i2s_transferterminatesend(priv->i2s_base, &priv->si_tx_handle);
	}
#endif

#if defined(I2S_HAVE_RX) && (0 < I2S_HAVE_RX)
	if (dir == I2S_RX) {
		i2s_transferterminatereceive(priv->i2s_base, &priv->si_rx_handle);
	}
#endif

	i2s_exclsem_give(priv);

	return 0;
}

/****************************************************************************
* Name: i2s_err_cb_register
*
* Description:
*   Register the error callback
*
* Input Parameters:
*   dev      - Device-specific state data
*   cb       - the function pointer to callback
*   arg      - argument to be transferred to the callback function
*
* Returned Value:
*  OK
*
****************************************************************************/
static int i2s_err_cb_register(struct i2s_dev_s *dev, i2s_err_cb_t cb, void *arg)
{
	struct imxrt_i2s_s *priv = (struct imxrt_i2s_s *)dev;
	DEBUGASSERT(priv);

	priv->err_cb = cb;
	priv->err_cb_arg = arg;

	return 0;
}

/****************************************************************************
* Name: i2s_set_clk
*
* Description:
*   Set the I2S clock.
*
* Input Parameters:
*   dev  - Device-specific state data
*   rate - The I2S sample rate in samples (not bits) per second
*   bits - bits in per sample
*   ch   - channel count
* Returned Value:
*   Returns the resulting bitrate
*
****************************************************************************/					
int i2s_set_clk(struct imxrt_i2s_s *priv, uint32_t rate, i2s_bits_per_sample_t bits, i2s_channel_t ch)
{
	sai_transfer_format_t format;
	uint32_t mclkSourceClockHz = 0U;

	if (bits > I2S_BITS_PER_SAMPLE_32BIT || bits < I2S_BITS_PER_SAMPLE_16BIT || (bits % 8) != 0) {
		i2sinfo("[I2S] Invalid bits per sample\n");
		return ERROR;
	}

	i2sinfo("[I2S] enter set clk:%d, %d, %d...\n", rate, bits, ch);
	if (NULL == priv) {
		i2sinfo("[I2S] g_i2sdevice Not initialized yet\n");
		return ERROR;
	}
	priv->sample_rate = rate;

	/* stop all transfer before configure I2S */
	i2s_stop((struct i2s_dev_s *)priv, I2S_RX);
	i2s_stop((struct i2s_dev_s *)priv, I2S_TX);

	// wait all on-going writing finish
	i2s_exclsem_take(priv);

	if (priv->channel_num != ch) {
		priv->channel_num = (ch == 2) ? 2 : 1;

		i2sinfo("[I2S] channel_num:%d tx_chan_mode:%d, tx_fifi_mode: %d; rx_chan_mode:%d, rx_fifi_mode: %d; \n", priv->channel_num, I2S[i2s_num]->conf_chan.tx_chan_mod, I2S[i2s_num]->fifo_conf.tx_fifo_mod, I2S[i2s_num]->conf_chan.rx_chan_mod, I2S[i2s_num]->fifo_conf.rx_fifo_mod);
	}

	if (bits != priv->bits_per_sample) {

		priv->bits_per_sample = bits;

		i2sinfo("[I2S] bits_per_sample:%d tx_chan_mode:%d, tx_fifi_mode: %d; rx_chan_mode:%d, rx_fifi_mode: %d; \n", priv->bits_per_sample, I2S[i2s_num]->conf_chan.tx_chan_mod, I2S[i2s_num]->fifo_conf.tx_fifo_mod, I2S[i2s_num]->conf_chan.rx_chan_mod, I2S[i2s_num]->fifo_conf.rx_fifo_mod);
	}

	/* Configure the audio format */
	format.bitWidth = priv->bits_per_sample;
	format.channel = priv->channel_num;
	format.sampleRate_Hz = priv->sample_rate;
	format.masterClockHz = OVER_SAMPLE_RATE * format.sampleRate_Hz;
	format.protocol = kSAI_BusI2S;
	format.stereo = kSAI_Stereo;
	format.isFrameSyncCompact = false;
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	format.watermark = FSL_FEATURE_SAI_FIFO_COUNT / 2U;
#endif

	/* Copy format to handle */
	priv->si_tx_handle.bitWidth = format.bitWidth;
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	priv->si_tx_handle.watermark = format.watermark;
#endif
	priv->si_tx_handle.channel = format.channel;
	mclkSourceClockHz = OVER_SAMPLE_RATE * format.sampleRate_Hz;
	i2s_tx_setformat(priv->i2s_base, &format, mclkSourceClockHz, format.masterClockHz);

	/* Copy format to handle */
	priv->si_rx_handle.bitWidth = format.bitWidth;
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	priv->si_rx_handle.watermark = format.watermark;
#endif
	priv->si_rx_handle.channel = format.channel;
	mclkSourceClockHz = OVER_SAMPLE_RATE * format.sampleRate_Hz;
	i2s_rx_setformat(priv->i2s_base, &format, mclkSourceClockHz, format.masterClockHz);


	// wait all writing on-going finish
	i2s_exclsem_give(priv);

	return OK;
}

/****************************************************************************
 * Name: esp32_i2s_isr_initialize
 *
 * Description:
 *   allocate isr for i2s modules
 *
 * Input Parameters:
 *   priv - Partially initialized I2S device structure.  These functions
 *          will complete the I2S specific portions of the initialization
 *
 * Returned Value:
 *   configure status
 *
 *
 ****************************************************************************/
static int imxrt_i2s_isr_initialize(struct imxrt_i2s_s *priv)
{
	/* Attach the GPIO peripheral to the allocated CPU interrupt */
	up_disable_irq(priv->tx_isr_num);

	/* Attach and enable the IRQ */
	int ret = irq_attach(priv->tx_isr_num, priv->isr_handler, priv);
	if (ret == OK) {
		/* Enable the CPU interrupt */
		up_enable_irq(priv->tx_isr_num);
	}

	up_disable_irq(priv->rx_isr_num);

	/* Attach and enable the IRQ */
	ret = irq_attach(priv->rx_isr_num, priv->isr_handler, priv);
	if (ret == OK) {
		/* Enable the CPU interrupt */
		up_enable_irq(priv->rx_isr_num);
	}
	return ret;
}

/****************************************************************************
* Name: i2s_samplerate
*
* Description:
*   Set the I2S sample rate.
*
* Input Parameters:
*   dev  - Device-specific state data
*   rate - The I2S sample rate in samples (not bits) per second
*
* Returned Value:
*   Returns the resulting bitrate
*
****************************************************************************/

static uint32_t i2s_samplerate(struct i2s_dev_s *dev, uint32_t rate)
{
	struct imxrt_i2s_s *priv = (struct imxrt_i2s_s *)dev;
	DEBUGASSERT(priv && rate > 0);
	return i2s_set_clk(priv, rate, priv->bits_per_sample, priv->channel_num);
}

/****************************************************************************
* Name: i2s_irq_handler
*
* Description:
*   ISR function for I2S.
*
* Input Parameters:
*   irq  - irq number
*   context - context
*   arg - Device-specific state data
*
* Returned Value:
*
*
****************************************************************************/

static int i2s_irq_handler(int irq, FAR void *context, FAR void *arg)
{
	struct imxrt_i2s_s *priv = (struct imxrt_i2s_s *)arg;

	if (priv->txenab) {
#if defined(I2S_HAVE_TX) && (0 < I2S_HAVE_TX)
		i2s_transfer_tx_handleirq(priv->i2s_base, &priv->si_tx_handle);
#endif
	}

