Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s.c
	if (priv->rxenab) {
#if defined(I2S_HAVE_RX) && (0 < I2S_HAVE_RX)
		i2s_transfer_rx_handleirq(priv->i2s_base, &priv->si_rx_handle);
#endif
	}

	return OK;
}

void imxrt_i2s_initpins(void)
{
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL,        /* GPIO_AD_B1_00 is configured as LPI2C1_SCL */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_00 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA,        /* GPIO_AD_B1_01 is configured as LPI2C1_SDA */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_01 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_09_SAI1_MCLK,         /* GPIO_AD_B1_09 is configured as SAI1_MCLK */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_09 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_12_SAI1_RX_DATA00,    /* GPIO_AD_B1_12 is configured as SAI1_RX_DATA00 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_12 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_13_SAI1_TX_DATA00,    /* GPIO_AD_B1_13 is configured as SAI1_TX_DATA00 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_13 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_14_SAI1_TX_BCLK,      /* GPIO_AD_B1_14 is configured as SAI1_TX_BCLK */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_14 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_15_SAI1_TX_SYNC,      /* GPIO_AD_B1_15 is configured as SAI1_TX_SYNC */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_15 */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL,        /* GPIO_AD_B1_00 PAD functional properties : */
		0xD8B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Enabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 22K Ohm Pull Up
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA,        /* GPIO_AD_B1_01 PAD functional properties : */
		0xD8B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Enabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 22K Ohm Pull Up
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_09_SAI1_MCLK,         /* GPIO_AD_B1_09 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_12_SAI1_RX_DATA00,    /* GPIO_AD_B1_12 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_13_SAI1_TX_DATA00,    /* GPIO_AD_B1_13 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_14_SAI1_TX_BCLK,      /* GPIO_AD_B1_14 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_15_SAI1_TX_SYNC,      /* GPIO_AD_B1_15 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
}

void imxrt_i2s_clock_init(void)
{
	imxrt_clock_initaudiopll(&audioPllConfig);
	/*Clock setting for LPI2C*/
	imxrt_clock_setmux(kCLOCK_Lpi2cMux, DEMO_LPI2C_CLOCK_SOURCE_SELECT);
	imxrt_clock_setdiv(kCLOCK_Lpi2cDiv, DEMO_LPI2C_CLOCK_SOURCE_DIVIDER);

	/*Clock setting for SAI1*/
	imxrt_clock_setmux(kCLOCK_Sai1Mux, DEMO_SAI1_CLOCK_SOURCE_SELECT);
	imxrt_clock_setdiv(kCLOCK_Sai1PreDiv, DEMO_SAI1_CLOCK_SOURCE_PRE_DIVIDER);
	imxrt_clock_setdiv(kCLOCK_Sai1Div, DEMO_SAI1_CLOCK_SOURCE_DIVIDER);

