Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s.c
	IOMUXC_GPR->GPR1 |= IOMUXC_GPR_GPR1_SAI1_MCLK_DIR_MASK;
}

#ifdef IMXRT_AUDIO_CODEC
void BOARD_Codec_I2C_Init(void)
{
	BOARD_LPI2C_Init(BOARD_CODEC_I2C_BASEADDR, BOARD_CODEC_I2C_CLOCK_FREQ);
}

status_t BOARD_Codec_I2C_Send(
	uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize)
{
	return BOARD_LPI2C_Send(BOARD_CODEC_I2C_BASEADDR, deviceAddress, subAddress, subAddressSize, (uint8_t *)txBuff,
				txBuffSize);
}

status_t BOARD_Codec_I2C_Receive(
	uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize)
{
	return BOARD_LPI2C_Receive(BOARD_CODEC_I2C_BASEADDR, deviceAddress, subAddress, subAddressSize, rxBuff, rxBuffSize);
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name:
 *
 * Description:
 *   Initialize the selected i2s port
 *
 * Input Parameter:
 *   none
 *
 * Returned Value:
 *   Valid i2s device structure reference on succcess; a NULL on failure
 *
 ****************************************************************************/
struct i2s_dev_s *imxrt_i2s_initialize(uint16_t port)
{
	if (port >= I2S_NUM_MAX) {
		i2serr("ERROR: Port number outside the allowed port number range\n");
		return NULL;
	}
	if (g_i2sdevice[port] != NULL) {
		return &g_i2sdevice[port]->dev;
	}

	struct imxrt_i2s_s *priv;
	int ret;
	i2s_config_t i2s_config = { 0 };
	sai_config_t sai_config = { 0 };

	/* Allocate a new state structure for this chip select.  NOTE that there
	 * is no protection if the same chip select is used in two different
	 * chip select structures.
	 */
	priv = (struct imxrt_i2s_s *)zalloc(sizeof(struct imxrt_i2s_s));
	if (!priv) {
		i2serr("ERROR: Failed to allocate a chip select structure\n");
		return NULL;
	}

	imxrt_i2s_initpins();
	imxrt_i2s_clock_init();

	/* Initialize the I2S priv device structure  */
	sem_init(&priv->exclsem, 0, 1);
	priv->dev.ops = &g_i2sops;

	/* if port does not exist or is not enabled, return error */
	switch (port) {
	case I2S_NUM_0:
	{
		priv->i2s_base = s_saiBases[1];
		priv->tx_isr_num = SAI1_IRQn;
		priv->rx_isr_num = SAI1_IRQn;

		i2s_config = i2s0_default_config;
	}
	break;
	case I2S_NUM_1:
	{
		priv->i2s_base = s_saiBases[2];
		priv->tx_isr_num = SAI2_IRQn;
		priv->rx_isr_num = SAI2_IRQn;

		i2s_config = i2s1_default_config;
	}
	break;
	case I2S_NUM_2:
	{
		priv->i2s_base = s_saiBases[3];
		priv->tx_isr_num = SAI3_TX_IRQn;
		priv->rx_isr_num = SAI3_RX_IRQn;

		i2s_config = i2s2_default_config;
	}
	break;
	default:
		i2serr("ERROR: Port number outside the allowed port number range\n");
		goto errout_with_clocking;
	}

	/* Initialize buffering */
#if defined(I2S_HAVE_RX) && (0 < I2S_HAVE_RX)
	i2s_rx_getdefaultconfig(&sai_config);
	i2s_rx_init(priv->i2s_base, &sai_config);
	priv->rxenab = 1;
#endif

#if defined(I2S_HAVE_TX) && (0 < I2S_HAVE_TX)
	i2s_tx_getdefaultconfig(&sai_config);
	i2s_tx_init(priv->i2s_base, &sai_config);
	priv->txenab = 1;
#endif

	/* Basic settings */
	priv->i2s_num = port;
	priv->mode = i2s_config.mode;
	priv->bytes_per_sample = 0;
	priv->intrupt_level = i2s_config.int_alloc_level;

	/* configures IRQ */
	priv->isr_handler = &i2s_irq_handler;
	ret = imxrt_i2s_isr_initialize(priv);
	if (ret != OK) {
		i2serr("I2S initialize: isr fails\n");
		goto errout_with_alloc;
	}

	g_i2sdevice[port] = priv;

	i2s_stop((struct i2s_dev_s *)priv, I2S_RX);
	i2s_stop((struct i2s_dev_s *)priv, I2S_TX);

	priv->channel_num = 2;
	priv->bits_per_sample = 16;

	ret = i2s_set_clk(priv, i2s_config.sample_rate, i2s_config.bits_per_sample, (i2s_config.channel_format < I2S_CHANNEL_FMT_ONLY_RIGHT) ? 2 : 1);
	if (ret != OK) {
		i2serr("I2S initialize: i2s_set_clk fails\n");
		goto errout_with_alloc;
	}

	/* Success exit */
	return &priv->dev;

	/* Failure exits */
errout_with_alloc:
errout_with_clocking:
	sem_destroy(&priv->exclsem);
	kmm_free(priv);
	return NULL;
}
#endif							/* I2S_HAVE_RX || I2S_HAVE_TX */
